sexy_calculator/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		# get data from the form
		user_params = params.require(:user).permit(:first_name, :last_name, :email, :password, :password_confirmation)
		#give the data to the model
		@user = User.new(user_params)
		#save the model
		if @user.save