sexy_calculator/app/views/users/show.html.erb

  <ul>
  <% @user.orders.each do |order| %>
---
SELECT "orders".* FROM "orders"  WHERE "orders"."user_id" = ?  [["user_id", 1]]